tap "jdx/tap"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "s6n-jp/tap"
brew "atuin"
brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "gping"
brew "imagemagick"
brew "jq"
brew "just"
brew "mas"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "openssh"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tokei"
brew "xh"
brew "ykman"
brew "zellij"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "s6n-jp/tap/ghr"
cask "aldente"
cask "arc"
cask "cleanshot"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox@developer-edition"
cask "font-udev-gothic-nf"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "keybase"
cask "neovide"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "visual-studio-code"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "LINE", id: 539883307
mas "Velja", id: 1607635845
