tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "s6n-jp/tap"

brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "gping"
brew "imagemagick"
brew "jq"
brew "just"
brew "mas"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tokei"
brew "xh"
brew "ykman"
brew "zellij"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "s6n-jp/tap/ghr"
cask "alacritty"
cask "aldente"
cask "arc"
cask "cleanshot"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox@developer-edition"
cask "font-udev-gothic-nf"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "keybase"
cask "neovide"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "visual-studio-code"
cask "zed"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Velja", id: 1607635845
vscode "ambar.bundle-size"
vscode "antfu.iconify"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vsls-contrib.codetour"
vscode "vsls-contrib.gistfs"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "znck.grammarly"
