tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "s6n-jp/tap"

brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "gping"
brew "jq"
brew "mas"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tokei"
brew "zellij"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "s6n-jp/tap/ghr"

cask "alacritty"
cask "aldente"
cask "arc"
cask "cleanshot"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "font-udev-gothic-nf"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "keybase"
cask "neovide"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "visual-studio-code"
cask "zoom"

cask_args appdir: "~/Applications", require_sha: true
