brew "coreutils"
brew "ffmpeg"
brew "gnu-time"
brew "gnupg"
brew "pinentry-mac"
brew "pkgconf"
brew "ykman"
cask "arc"
cask "claude-code"
cask "cleanshot"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox@developer-edition"
cask "font-udev-gothic-nf"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "notion"
cask "notion-calendar"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
